Repository: v-daspac/Repository
Catalog: LQA_MAR2017/*/reference/spfx/sp-http/20170117_fetch-sphttpclient.xlf
Languages: it_it

# p101
source: **Note:** The SharePoint Framework is currently in preview and is subject to change. SharePoint Framework client-side web parts are not currently supported for use in production environments.
it_it: **Nota:** al momento, SharePoint Framework è in versione di anteprima e potrebbe essere soggetto a modifiche. Le web part sul lato client di SharePoint Framework attualmente non sono supportate in ambienti di produzione.

# p102
source: Generally, the parameters and semantics for SPHttpClient.fetch() are essentially the same as the WHATWG API standard that is documented here: https://fetch.spec.whatwg.org/ The SPHttpClient subclass adds some additional behaviors that are convenient when working with SharePoint ODATA API's (which can be avoided by using HttpClient instead): - Default "Accept" and "Content-Type" headers are added if not explicitly specified. - For write operations, an "X-RequestDigest" header is automatically added - The request digest token is automatically fetched and stored in a cache, with support for preloading For a write operation, SPHttpClient will automatically add the "X-RequestDigest" header, which may need to be obtained by issuing a seperate request such as "https://example.com/sites/sample/_api/contextinfo". Typically the appropriate SPWeb URL can be guessed by looking for a reserved URL segment such as "_api" in the original URL passed to fetch(); if not, use ISPHttpClientOptions.webUrl to specify it explicitly.
it_it: Generalmente, i parametri e la semantica di SPHttpClient.fetch() sono praticamente uguali allo standard API WHATWG documentato qui: https://fetch.spec.whatwg.org/ La sottoclasse SPHttpClient aggiunge alcuni comportamenti che sono utili quando si lavora con le API ODATA di SharePoint (che possono essere evitate utilizzando in alternativa HttpClient): - Le intestazioni predefinite "Accept" e "Content-Type" vengono aggiunte se non specificato esplicitamente. - Per le operazioni di scrittura, un'intestazione "X-RequestDigest" viene aggiunta automaticamente - Il token digest della richiesta viene recuperato automaticamente e memorizzato in una cache, con il supporto di precaricamento Per un'operazione di scrittura, SPHttpClient aggiungerà automaticamente l'intestazione "X-RequestDigest", che potrebbe essere ottenuta inviando una richiesta separata come ad esempio "https://example.com/sites/sample/_api/contextinfo". In genere l'URL SPWeb appropriato può essere ipotizzato cercando un segmento URL riservato, ad esempio "_api" nell'URL originale passato a fetch(); in caso contrario, utilizzare ISPHttpClientOptions.webUrl per specificarlo in modo esplicito.

source: **Signature:** _@override public fetch(url: string, configuration: [SPHttpClientConfiguration](../sp-http/sphttpclientconfiguration.md), options: [ISPHttpClientOptions](../sp-http/isphttpclientoptions.md)): Promise<[SPHttpClientResponse](../sp-http/sphttpclientresponse.md)>;_
it_it: **Firma:** _@override public fetch(url: string, configurazione: [SPHttpClientConfiguration](../sp-http/sphttpclientconfiguration.md), opzioni: [ISPHttpClientOptions](../sp-http/isphttpclientoptions.md)): Promise<[SPHttpClientResponse](../sp-http/sphttpclientresponse.md)>;_

source: **Returns**: `Promise<SPHttpClientResponse>`
it_it: **Restituisce**: `Promise<SPHttpClientResponse>`

source: a promise that will return the result
it_it: una promessa che verrà restituito il risultato

source: Parameters
it_it: Parametri

source: Parameter
it_it: Parametro

source: Type
it_it: Tipo

source: Description
it_it: Descrizione

source: the URL to fetch
it_it: l'URL per recuperare

source: determines the default behavior of SPHttpClient; normally this should be the latest version number from SPHttpClientConfigurations
it_it: determina il comportamento predefinito di SPHttpClient; in genere dovrebbe essere il numero di versione più recente da SPHttpClientClientConfigurations

source: additional options that affect the request
it_it: altre opzioni che riguardano la richiesta
