Repository: v-daspac/Repository
Catalog: LQA_MAR2017/*/docs/spfx/toolchain/20170213_integrate-gulp-tasks-*-build-pipeline.xlf
Languages: it_it, ko_kr

source: Integrate gulp tasks in SharePoint Framework toolchain
it_it: Integrare le attività di gulp nella toolchain di SharePoint Framework
ko_kr: SharePoint Framework 도구 체인에 gulp 작업 통합

# p101
source: **Note:** The SharePoint Framework is currently in preview and is subject to change. SharePoint Framework client-side web parts are not currently supported for use in production environments.
it_it: **Nota:** al momento, SharePoint Framework è in versione di anteprima e potrebbe essere soggetto a modifiche. Le web part sul lato client di SharePoint Framework attualmente non sono supportate in ambienti di produzione.
ko_kr: **참고:** SharePoint Framework는 현재 미리 보기로 제공되며 변경될 수 있습니다. SharePoint Framework 클라이언트 쪽 웹 파트는 현재 프로덕션 환경에서 사용하도록 지원되지 않습니다.

source: SharePoint client-side development tools use [gulp](http://gulpjs.com/) as the build process task runner to:
it_it: Gli strumenti di sviluppo lato client di SharePoint utilizzano [gulp](http://gulpjs.com/) come lo strumento di esecuzione attività del processo di creazione per:
ko_kr: SharePoint 클라이언트 쪽 개발 도구는 빌드 프로세스 작업 실행기로 [gulp](http://gulpjs.com/)를 사용하여 다음을 수행합니다.

source: Bundle and minify JavaScript and CSS files.
it_it: Aggregare e minimizzare file JavaScript e CSS.
ko_kr: JavaScript 및 CSS 파일을 번들로 묶고 축소합니다.

source: Run tools to call the bundling and minification tasks before each build.
it_it: Eseguire gli strumenti per chiamare le attività di aggregazione e minimizzazione prima di ogni compilazione.
ko_kr: 각 빌드 전에 번들화 및 축소 작업을 호출하는 도구를 실행합니다.

source: Compile LESS or SASS files to CSS.
it_it: Compilare i file SASS in CSS.
ko_kr: ESS 또는 SASS 파일을 CSS로 컴파일합니다.

source: Compile TypeScript files to JavaScript.
it_it: Compilare i file TypeScript in JavaScript.
ko_kr: TypeScript 파일을 JavaScript로 컴파일합니다.

source: One common task you would want to add to the SharePoint Framework toolchain is to integrate your custom gulp tasks in the build pipeline.
it_it: L'integrazione delle attività di gulp nella pipeline di compilazione rappresenta una delle attività comuni che l'utente potrebbe voler aggiungere alla toolchain di SharePoint Framework.
ko_kr: SharePoint Framework 도구 체인에 추가하려는 일반적인 작업은 빌드 파이프라인에 사용자 지정 gulp 작업을 통합하는 것입니다.

source: Gulp tasks
it_it: Attività di gulp
ko_kr: Gulp 작업

source: Normally gulp tasks are defined in the `gulpfile.js` as:
it_it: In genere, le attività di gulp vengono definite in `gulpfile.js` come:
ko_kr: 일반적으로 Gulp 작업은 `gulpfile.js`에 다음과 같이 정의됩니다.

# p102
source: When working with the SharePoint Framework toolchain, it is necessary to define your tasks in the framework's build pipeline. Once defined and registered with the pipeline, the task will be added to the toolchain.
it_it: Quando si utilizza la toolchain di SharePoint Framework, è necessario definire le attività nella pipeline di compilazione del framework. Una volta definita e registrata nella pipeline, l'attività verrà aggiunta alla toolchain.
ko_kr: SharePoint Framework 도구 체인으로 작업할 때 프레임워크의 빌드 파이프라인에서 작업을 정의해야 합니다. 작업은 정의되고 파이프라인에 등록된 후에 도구 체인에 추가됩니다.

# p103
source: SharePoint Framework uses a [common build toolchain](sharepoint-framework-toolchain.md#common-build-tools-packages) which consists of a set of npm packages that share common build tasks. And hence, the default tasks are defined in the common package as opposed to your client-side project's `gulpfile.js`. To see the available tasks, you can execute the following command in a console within your project directory:
it_it: SharePoint Framework utilizza una [toolchain di compilazione comune](sharepoint-framework-toolchain.md#common-build-tools-packages), vale a dire, un set di pacchetti npm che condividono attività di compilazione comuni. Di conseguenza, le attività preimpostate vengono definite nel pacchetto comune come opposte rispetto al `gulpfile.js` del progetto sul lato client. Per visualizzare le attività disponibili, è possibile eseguire il comando seguente in una console disponibile all'interno della directory di progetto:
ko_kr: SharePoint Framework는 일반적인 빌드 작업을 공유하는 npm 패키지 집합으로 구성되는 [공용 빌드 도구 체인](sharepoint-framework-toolchain.md#common-build-tools-packages)을 사용합니다. 따라서 기본 작업은 클라이언트 쪽 프로젝트의 `gulpfile.js`와 달리 일반적인 패키지에 정의됩니다. 사용할 수 있는 작업을 보려면 프로젝트 디렉터리 내의 콘솔에서 다음 명령을 실행할 수 있습니다.

source: The command above will list all the available tasks.
it_it: Il comando riportato in precedenza conterrà un elenco di tutte le attività disponibili.
ko_kr: 위의 명령을 실행하면 사용 가능한 모든 작업이 표시됩니다.

source: Available gulp tasks
it_it: Attività di gulp disponibili
ko_kr: 사용할 수 있는 gulp 작업

source: Custom gulp tasks
it_it: Attività di gulp personalizzate
ko_kr: 사용자 지정 gulp 작업

# p104
source: To add your custom tasks, you will define the custom tasks in the `gulpfile.js`. Open the `gulpfile.js` in your code editor. The default code initializes the SharePoint Framework toolchain and the global `gulp` instance for the toolchain. Any custom tasks added should be defined before initializing the global `gulp` instance.
it_it: Per aggiungere le attività personalizzate, è necessario definirle in `gulpfile.js`. Aprire `gulpfile.js` nell'editor di codice. Il codice predefinito inizializza la toolchain di SharePoint Framework e l'istanza `gulp` globale per la toolchain. Tutte le attività personalizzate aggiunte devono essere definite prima di inizializzare l'istanza `gulp` globale.
ko_kr: 사용자 지정 작업을 추가하려면 `gulpfile.js`에서 사용자 지정 작업을 정의합니다. 코드 편집기에서 `gulpfile.js`를 엽니다. 기본 코드는 SharePoint Framework 도구 체인 및 해당 도구 체인에 대한 전역 `gulp` 인스턴스를 초기화합니다. 추가된 모든 사용자 지정 작업은 전역 `gulp` 인스턴스를 초기화하기 전에 정의해야 합니다.

source: Add your custom task
it_it: Aggiungere attività personalizzate
ko_kr: 사용자 지정 작업 추가

source: To add your custom gulp task, you will add a new sub task to the SharePoint Framework build pipeline using the [`build.subTask`](https://github.com/Microsoft/gulp-core-build#defining-a-custom-task) function:
it_it: Per aggiungere un'attività di gulp personalizzata, è necessario aggiungere una nuova attività secondaria alla pipeline di compilazione di SharePoint Framework tramite la funzionalità [`build.subTask`](https://github.com/Microsoft/gulp-core-build#defining-a-custom-task):
ko_kr: 사용자 지정 gulp 작업을 추가하려면 [`build.subTask`](https://github.com/Microsoft/gulp-core-build#defining-a-custom-task) 함수를 사용하여 SharePoint Framework 빌드 파이프라인에 새 하위 작업을 추가합니다.

source: In the case of a stream, you will return the stream:
it_it: Nel caso di un flusso, l'utente restituisce il flusso:
ko_kr: 스트림의 경우 스트림을 반환합니다.

source: Register your task with gulp command line
it_it: Registrare l'attività con la riga di comando del gulp
ko_kr: gulp 명령줄에 작업 등록

source: Once the custom task is defined, you can then register this custom task with the gulp command line using the `build.task` function:
it_it: Una volta definita l'attività personalizzata, è possibile registrarla con la riga di comando del gulp utilizzando la funzionalità `build.task`:
ko_kr: 사용자 지정 작업이 정의된 후에는 `build.task` 함수를 사용하여 이 사용자 지정 작업을 gulp 명령줄에 등록할 수 있습니다.

source: Note: Any custom tasks added should be defined before initializing the global `gulp` instance, that is before the following line of code: `build.initialize(gulp);`
it_it: Nota: Tutte le attività personalizzate aggiunte devono essere definite prima di inizializzare l'istanza `gulp` globale, vale a dire, prima della riga di codice seguente: `build.initialize(gulp);`
ko_kr: 참고: 추가된 모든 사용자 지정 작업은 전역 `gulp` 인스턴스를 초기화하기 전에 `build.initialize(gulp);` 코드 줄 앞에 정의해야 합니다.

source: Now you can execute your custom command in the command line as follows:
it_it: Ora è possibile eseguire il comando personalizzato nella riga di comando, così come riportato di seguito:
ko_kr: 이제 다음과 같이 명령줄에서 사용자 지정 명령을 실행할 수 있습니다.

# p105
source: Note: You cannot execute the sub task registered using the `build.subTask` function directly from the command line. You can only execute the task registered using the `build.task` function.
it_it: Nota: Non è possibile eseguire l'attività secondaria registrata utilizzando la funzionalità `build.subTask` direttamente dalla riga di comando. È possibile eseguire soltanto l'attività registrata utilizzando la funzionalità `build.task`:
ko_kr: 참고: 명령줄에서 직접 `build.subTask` 함수를 사용하여 등록된 하위 작업을 실행할 수는 없습니다. `build.task` 함수를 사용해야만 등록된 작업을 실행할 수 있습니다.

source: Execute your custom task before or after available tasks
it_it: Eseguire l'attività personalizzata prima o dopo le attività disponibili
ko_kr: 사용 가능한 작업 전후에 사용자 지정 작업 실행

# p106
source: You can also add this custom task to be executed before or after certain available gulp tasks. The following gulp tasks allow you to inject your custom task before or after task:
it_it: È anche possibile aggiungere questa attività personalizzata in modo che sia eseguita prima o dopo determinate attività di gulp disponibili. L'attività di gulp seguente permette di inserire l'attività personalizzata prima o dopo l'attività:
ko_kr: 또한 사용할 수 있는 특정 gulp 작업 전후에 실행되도록 사용자 지정 작업을 추가할 수도 있습니다. 다음 gulp 작업을 사용하여 작업 전후에 사용자 지정 작업 삽입할 수 있습니다.

source: Generic build task (that consists all the available tasks)
it_it: Attività di compilazione generica (include tutte le attività disponibili)
ko_kr: 일반적인 빌드 작업(사용 가능한 모든 작업으로 구성)

source: TypeScript task
it_it: Attività typescript
ko_kr: TypeScript 작업

# p107
source: The SharePoint Framework tasks are available in the default build rig. The build rig is a collection of tasks defined for a specific purpose. In our case, building client-side packages. You can access this default rig using the `build.rig` object and get access to the pre and post task functions:
it_it: Le attività di SharePoint Framework sono disponibili negli strumenti di compilazione predefiniti. Gli strumenti di compilazione consistono in una serie di attività definite per uno scopo preciso. In questo caso, la compilazione di pacchetti lato client. È possibile accedere a questi strumenti predefiniti utilizzando l'oggetto `build.rig` e ottenere le funzionalità da usare prima e dopo l'attività:
ko_kr: SharePoint Framework 작업은 기본 빌드 Rig에서 사용할 수 있습니다. 빌드 Rig는 특정 용도로 정의된 작업의 컬렉션입니다. 이 경우에는 클라이언트 쪽 패키지 빌드가 작업의 용도입니다. `build.rig` 개체를 사용하여 이 기본 Rig에 액세스하고 사전 및 사후 작업 함수에 대한 액세스 권한을 얻을 수 있습니다.

source: Example: Custom image resize task
it_it: Esempio: Attività di ridimensionamento di un'immagine personalizzata
ko_kr: 예제: 사용자 지정 이미지 크기 조정 작업

# p108
source: As an example, let's use the [image resize gulp task](https://www.npmjs.com/package/gulp-image-resize). It's a simple task that allows you to resize images.
it_it: Ad esempio, utilizzare l'[attività di gulp per il ridimensionamento di un'immagine](https://www.npmjs.com/package/gulp-image-resize). Si tratta di un'attività semplice che consente di ridimensionare le immagini.
ko_kr: 예를 들어 [이미지 크기 조정 gulp 작업](https://www.npmjs.com/package/gulp-image-resize)을 사용해 보겠습니다. 이 작업은 이미지 크기를 조정할 수 있는 간단한 작업입니다.

source: You can download the completed sample [here](https://aka.ms/spfx-extend-gulp-sample).
it_it: È possibile scaricare l'esempio completo [qui](https://aka.ms/spfx-extend-gulp-sample).
ko_kr: 전체 샘플은 [여기](https://aka.ms/spfx-extend-gulp-sample)에서 다운로드할 수 있습니다.

source: In the [image resize task's documentation](https://www.npmjs.com/package/gulp-image-resize#example), it shows how to use this custom task:
it_it: Nella [documentazione relativa all'attività di ridimensionamento delle immagini](https://www.npmjs.com/package/gulp-image-resize#example), viene mostrato come usare questa attività personalizzata:
ko_kr: [이미지 크기 조정 작업 설명서](https://www.npmjs.com/package/gulp-image-resize#example)에는 이 사용자 지정 작업을 사용하는 방법이 나와 있습니다.

source: We will use this information to add this task in our project using the `build.subTask` and `build.task` functions:
it_it: Queste informazioni vengono usate per aggiungere l'attività nel progetto utilizzando le funzionalità `build.subTask` e `build.task`:
ko_kr: 이 정보는 `build.subTask` 및 `build.task` 함수를 사용하여 프로젝트에 이 작업을 추가하는 데 사용됩니다.

# p109
source: Since we are defining the stream, we return the stream in the `build.subTask` function to the build pipeline. The build pipeline will then asynchronously execute this gulp stream.
it_it: Dal momento che si sta definendo un flusso, il flusso della funzionalità `build.subTask` viene restituito nella pipeline di compilazione. In seguito, la pipeline di compilazione esegue in modo asincrono questo flusso di gulp.
ko_kr: 스트림을 정의해야 하므로 `build.subTask` 함수의 스트림을 빌드 파이프라인으로 반환합니다. 그러면 빌드 파이프라인은 이 gulp 스트림을 비동기적으로 실행합니다.

source: Now, you can execute this task from the gulp command line as follows:
it_it: A questo punto, è possibile eseguire l'attività dalla riga di comando di gulp nel modo seguente:
ko_kr: 이제 다음과 같이 gulp 명령줄에서 이 작업을 실행할 수 있습니다.

source: You will also see this `resize-images` task in the available tasks for your project when you execute `gulp --tasks`:
it_it: L'attività `resize-images` verrà visualizzata nell'elenco di attività disponibili per il progetto quando si esegue `gulp --tasks`:
ko_kr: `gulp --tasks`를 실행할 때 프로젝트에 대한 사용 가능한 작업에서 `resize-images` 작업도 표시됩니다.

source: image-resize-task with available tasks
it_it: image-resize-task con attività disponibili
ko_kr: 사용 가능한 작업이 있는 image-resize-task
